Model: "Generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 1, 1, 100)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 4, 4, 1024)        1639424   
_________________________________________________________________
batch_normalization_5 (Batch (None, 4, 4, 1024)        4096      
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 4, 4, 1024)        0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 8, 8, 512)         8389120   
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 16, 16, 256)       2097408   
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 32, 32, 128)       524416    
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 32, 128)       512       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 64, 64, 64)        131136    
_________________________________________________________________
batch_normalization_9 (Batch (None, 64, 64, 64)        256       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 64, 64, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 64)        36928     
_________________________________________________________________
batch_normalization_10 (Batc (None, 64, 64, 64)        256       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 64, 64, 64)        0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 128, 128, 3)       3075      
_________________________________________________________________
activation_2 (Activation)    (None, 128, 128, 3)       0         
=================================================================
Total params: 12,829,699
Trainable params: 12,825,603
Non-trainable params: 4,096
_________________________________________________________________
Model: "Discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 128, 128, 3)       0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 128, 128, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 64, 64)        3136      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 64, 64, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 64, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 128)       131200    
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 128)       512       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 256)       524544    
_________________________________________________________________
batch_normalization_2 (Batch (None, 16, 16, 256)       1024      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 8, 512)         2097664   
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 8, 512)         2048      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 4, 1024)        8389632   
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 4, 1024)        4096      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 1024)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 4, 4, 1024)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 16385     
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 22,336,642
Trainable params: 11,166,401
Non-trainable params: 11,170,241
_________________________________________________________________
Model: "Generative Adversarial Network"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 1, 1, 100)         0         
_________________________________________________________________
Generator (Model)            (None, 128, 128, 3)       12829699  
_________________________________________________________________
Discriminator (Model)        (None, 1)                 11170241  
=================================================================
Total params: 23,999,940
Trainable params: 12,825,603
Non-trainable params: 11,174,337
_________________________________________________________________
